<?php

use Illuminate\Database\Seeder;
use App\Models\CertificateType;

class CertificateTypeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $certificateTypes = [
            [
                'id' => 1,
                'TypeName' => 'งานในที่อับอากาศ-ประกาศนียบัตรอบรมอับอากาศ/ทบทวนความรู-ผูอนุญาต',
                'Age' => 1825,
            ],
            [
                'id' => 2,
                'TypeName' => 'งานในที่อับอากาศ-หนังสือมอบหมายหนาที่ หรือคําสั่งแตงตั้ง',
                'Age' => 365,
            ],
            [
                'id' => 3,
                'TypeName' => 'ผลตรวจสุขภาพพิเศษตามลักษณะงาน-งานในที่อับอากาศ',
                'Age' => 365,
            ],
            [
                'id' => 4,
                'TypeName' => 'ใบประกาศฯหลักสูตรดับเพลิงขั้นตน',
                'Age' => 36500,
            ],
            [
                'id' => 5,
                'TypeName' => 'งานในที่อับอากาศ-ใบรับรองแพทย',
                'Age' => 30,
            ],
            [
                'id' => 6,
                'TypeName' => 'งานประดานํ้า-ทบทวนความรูและฝกปฏิบัติ',
                'Age' => 365,
            ],
            [
                'id' => 7,
                'TypeName' => 'งานประดานํ้า-ผลตรวจสุขภาพพิเศษตามลักษณะงาน',
                'Age' => 180,
            ],
            [
                'id' => 8,
                'TypeName' => 'งานประดานํ้า-บันทึกการแตงตั้งนักประดานํ้า กฟผ. (หัวหนานักประดานํ้า)',
                'Age' => 365,
            ],
            [
                'id' => 9,
                'TypeName' => 'งานประดานํ้า-บันทึกการแตงตั้งนักประดานํ้า กฟผ.',
                'Age' => 365,
            ],
            [
                'id' => 10,
                'TypeName' => 'งานประดานํ้า-อบรมหลักสูตรเวชศาสตรใตนํ้า',
                'Age' => 36500,
            ],
            [
                'id' => 11,
                'TypeName' => 'งานประดานํ้า-บันทึกการแตงตั้งพยาบาลเวชศาสตรใตนํ้า',
                'Age' => 36500,
            ],
            [
                'id' => 12,
                'TypeName' => 'งานที่ทําใหเกิดประกายไฟหรือความรอน-ทดสอบฝมือ ชางเชื่อม',
                'Age' => 365,
            ],
            [
                'id' => 13,
                'TypeName' => 'ใบรับรองการตรวจสอบ ทดสอบปนจั่นตามกฏหมาย',
                'Age' => 182,
            ],
            [
                'id' => 14,
                'TypeName' => 'งานติดตั้งและรื้อถอนนั่งราน-อบรมมาตรฐานการติดตั้งนั่งราน',
                'Age' => 36500,
            ],
            [
                'id' => 15,
                'TypeName' => 'งานติดตั้งและรื้อถอนนั่งราน-อบรมการติดตั้งและการตรวจสอบนั่งรานอยางปลอดภัย',
                'Age' => 36500,
            ],
            [
                'id' => 16,
                'TypeName' => 'จป.หัวหนางาน',
                'Age' => 36500,
            ],
            [
                'id' => 17,
                'TypeName' => 'งานใชปนจั่นอยูกับที่-ประกาศนียบัตรอบรมผูบังคับปนจั่น /ทบทวนความรู',
                'Age' => 730,
            ],
            [
                'id' => 18,
                'TypeName' => 'งานใชปนจั่นอยูกับที่-ทดสอบผูปฏิบัติงานขับเครื่องจักรกล',
                'Age' => 36500,
            ],
            [
                'id' => 19,
                'TypeName' => 'ผลตรวจสุขภาพพิเศษตามลักษณะงาน-ขับเครื่องจักกล',
                'Age' => 365,
            ],
            [
                'id' => 20,
                'TypeName' => 'งานใชปนจั่นเคลื่อนที่-ประกาศนียบัตรอบรมผูบังคับปนจั่น /ทบทวนความรู',
                'Age' => 36500,
            ],
            [
                'id' => 21,
                'TypeName' => 'งานใชปนจั่นเคลื่อนที่-ทดสอบผูปฏิบัติงานขับเครื่องจักรกล',
                'Age' => 36500,
            ],
            [
                'id' => 22,
                'TypeName' => 'งานใชปนจั่นเคลื่อนที่-ประกาศนียบัตรอบรม /ทบทวนความรู',
                'Age' => 36500,
            ],
            [
                'id' => 23,
                'TypeName' => 'งานขุดเจาะ-ประสบการณดานงานดิน',
                'Age' => 36500,
            ],
            [
                'id' => 24,
                'TypeName' => 'อบรมหลักสูตรชวยเหลือและปฐมพยาบาลเบื้องตน',
                'Age' => 36500,
            ],
            [
                'id' => 25,
                'TypeName' => 'งานกอสรางที่มีเสาเข็มและกําแพงพืด-ประสบการณดานเสาเข็ม/กําแพงพืด',
                'Age' => 36500,
            ],
            [
                'id' => 26,
                'TypeName' => 'งานเกี่ยวกับรังสี-ใบอนุญาตเจาหนาที่ความปลอดภัยทางรังสี',
                'Age' => 1825,
            ],
            [
                'id' => 27,
                'TypeName' => 'งานเกี่ยวกับรังสี-อบรมดานความปลอดภัยในการทํางานเกี่ยวกับรังสี',
                'Age' => 36500,
            ],
            [
                'id' => 28,
                'TypeName' => 'งานเกี่ยวกับสารเคมี-อบรมดานการปองกันอันตรายจากสารเคมี',
                'Age' => 36500,
            ],
            [
                'id' => 29,
                'TypeName' => 'อบรมชางไฟฟาภายในอาคาร ระดับ 1',
                'Age' => 1825,
            ],
            [
                'id' => 30,
                'TypeName' => 'อบรมความปลอดภัยในการทํางานเกี่ยวกับไฟฟา',
                'Age' => 36500,
            ],
            [
                'id' => 31,
                'TypeName' => 'งานใชรถโฟลคลิฟต-ประกาศนียบัตร พนักงานขับรถฟอรคลิฟท',
                'Age' => 36500,
            ],
            [
                'id' => 32,
                'TypeName' => 'งานใชรถโฟลคลิฟต-ทดสอบผูปฏิบัติงานขับเครื่องจักรกล',
                'Age' => 36500,
            ],
            [
                'id' => 33,
                'TypeName' => 'งานใชรถกระเชา-ประกาศนียบัตร พนักงานขับรถกระเชา',
                'Age' => 36500,
            ],
            [
                'id' => 34,
                'TypeName' => 'งานใชรถกระเชา-ทดสอบผูปฏิบัติงานขับเครื่องจักรกล',
                'Age' => 36500,
            ],
            [
                'id' => 35,
                'TypeName' => 'งานใชรถขุด-ประกาศนียบัตร พนักงานขับรถขุด',
                'Age' => 36500,
            ],
            [
                'id' => 36,
                'TypeName' => 'งานใชรถขุด-ทดสอบผูปฏิบัติงานขับเครื่องจักรกล',
                'Age' => 36500,
            ],
            [
                'id' => 37,
                'TypeName' => 'งานใชปนจั่นอยูกับที่-ประกาศนียบัตรอบรม/ทบทวนความรู-ผูใหสัญญาณ',
                'Age' => 730,
            ],
            [
                'id' => 38,
                'TypeName' => 'งานใชปนจั่นอยูกับที่-ประกาศนียบัตรอบรม/ทบทวนความรู-ผูยึดเกาะ',
                'Age' => 730,
            ],
            [
                'id' => 39,
                'TypeName' => 'งานใชปนจั่นอยูกับที่-ประกาศนียบัตรอบรม/ทบทวนความรู-ผูควบคุมการใชปนจั่น',
                'Age' => 730,
            ],
            [
                'id' => 40,
                'TypeName' => 'งานใชปนจั่นเคลื่อนที่-ประกาศนียบัตรอบรม/ทบทวนความรู-ผูใหสัญญาณ',
                'Age' => 730,
            ],
            [
                'id' => 41,
                'TypeName' => 'งานใชปนจั่นเคลื่อนที่-ประกาศนียบัตรอบรม/ทบทวนความรู-ผูยึดเกาะ',
                'Age' => 730,
            ],
            [
                'id' => 42,
                'TypeName' => 'งานใชปนจั่นเคลื่อนที่-ประกาศนียบัตรอบรม/ทบทวนความรู-ผูควบคุมการใชปนจั่น',
                'Age' => 730,
            ],
            [
                'id' => 43,
                'TypeName' => 'ผลตรวจสุขภาพพิเศษตามลักษณะงาน-ปนเสาสูง',
                'Age' => 365,
            ],
            [
                'id' => 44,
                'TypeName' => 'งานในที่อับอากาศ-ประกาศนียบัตรอบรมอับอากาศ/ทบทวนความรู-ผูควบคุม',
                'Age' => 1825,
            ],
            [
                'id' => 45,
                'TypeName' => 'งานในที่อับอากาศ-ประกาศนียบัตรอบรมอับอากาศ/ทบทวนความรู-ผูชวยเหลือ',
                'Age' => 1825,
            ],
            [
                'id' => 46,
                'TypeName' => 'งานในที่อับอากาศ-ประกาศนียบัตรอบรมอับอากาศ/ทบทวนความรู-ผูปฏิบัติงาน',
                'Age' => 1825,
            ],
            [
                'id' => 47,
                'TypeName' => 'อบรมพนักงานเขาทํางานใหมหลักสูตร ความปลอดภัย 6 ชั่วโมง',
                'Age' => 36500,
            ],
            [
                'id' => 48,
                'TypeName' => 'ขึ้นทะเบียนเปนผูใหบริการทดสอบเครื่องจักร',
                'Age' => 36500,
            ],
            [
                'id' => 49,
                'TypeName' => 'ขึ้นทะเบียนเปนผูใหบริการทดสอบปนจั่น',
                'Age' => 36500,
            ],
            [
                'id' => 50,
                'TypeName' => 'ขึ้นทะเบียนเปนผูใหบริการทดสอบหมอนํ้า',
                'Age' => 36500,
            ],
        ];

        foreach ($certificateTypes as $type) {
            CertificateType::create($type);
        }
    }
}
